[Killed] Block
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:10:42
 function replaceUrlParameterName(url: string, oldName: string, newName: string): string {
     // regex mit ? oder & davor abfragen
     // dafür dynamischen regex erstellen? oder beim initialisieren der Middleware besser
-    if (url.indexOf('?' + oldName) >= 0) {
-        return url.replace('?' + oldName, '?' + newName)
-    }
+    if (url.indexOf('?' + oldName) >= 0) {}
     return url.replace('&' + oldName, '&' + newName)
 }

[Killed] BinaryExpression
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:10:36
 function replaceUrlParameterName(url: string, oldName: string, newName: string): string {
     // regex mit ? oder & davor abfragen
     // dafür dynamischen regex erstellen? oder beim initialisieren der Middleware besser
-    if (url.indexOf('?' + oldName) >= 0) {
+    if (url.indexOf('?' + oldName) < 0) {
         return url.replace('?' + oldName, '?' + newName)
     }

[Timeout] Block
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:18:65
 
 export default function ParameterRewriter(obj: ParameterRewriteObject): RequestHandler {
     const keys = Object.keys(obj)
-    return (req: Request, res: Response, next: NextFunction) => {
-        keys.forEach(key => {
-            if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
-                req.url = replaceUrlParameterName(req.url, key, obj[key])
-                req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])
-                req.query[obj[key]] = req.query[key]
-                delete req.query[key]
-            }
-        })
-        next()
-    }
+    return (req: Request, res: Response, next: NextFunction) => {}
 }
 

[Killed] Block
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:19:29
 export default function ParameterRewriter(obj: ParameterRewriteObject): RequestHandler {
     const keys = Object.keys(obj)
     return (req: Request, res: Response, next: NextFunction) => {
-        keys.forEach(key => {
-            if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
-                req.url = replaceUrlParameterName(req.url, key, obj[key])
-                req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])
-                req.query[obj[key]] = req.query[key]
-                delete req.query[key]
-            }
-        })
+        keys.forEach(key => {})
         next()
     }

[Killed] BinaryExpression
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:20:79
     const keys = Object.keys(obj)
     return (req: Request, res: Response, next: NextFunction) => {
         keys.forEach(key => {
-            if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
+            if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) > 0) {
                 req.url = replaceUrlParameterName(req.url, key, obj[key])
                 req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])

[Killed] BinaryExpression
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:20:44
     const keys = Object.keys(obj)
     return (req: Request, res: Response, next: NextFunction) => {
         keys.forEach(key => {
-            if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
+            if (req.url.indexOf('?' + key) > 0 || req.url.indexOf('&' + key) >= 0) {
                 req.url = replaceUrlParameterName(req.url, key, obj[key])
                 req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])

[Killed] ConditionalExpression
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:21:17
     return (req: Request, res: Response, next: NextFunction) => {
         keys.forEach(key => {
             if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
-                req.url = replaceUrlParameterName(req.url, key, obj[key])
+                false
                 req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])
                 req.query[obj[key]] = req.query[key]

[Killed] ConditionalExpression
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:21:17
     return (req: Request, res: Response, next: NextFunction) => {
         keys.forEach(key => {
             if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
-                req.url = replaceUrlParameterName(req.url, key, obj[key])
+                true
                 req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])
                 req.query[obj[key]] = req.query[key]

[Killed] ConditionalExpression
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:22:17
         keys.forEach(key => {
             if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
                 req.url = replaceUrlParameterName(req.url, key, obj[key])
-                req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])
+                false
                 req.query[obj[key]] = req.query[key]
                 delete req.query[key]

[Killed] ConditionalExpression
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:22:17
         keys.forEach(key => {
             if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
                 req.url = replaceUrlParameterName(req.url, key, obj[key])
-                req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])
+                true
                 req.query[obj[key]] = req.query[key]
                 delete req.query[key]

[Killed] ConditionalExpression
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:23:17
             if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
                 req.url = replaceUrlParameterName(req.url, key, obj[key])
                 req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])
-                req.query[obj[key]] = req.query[key]
+                true
                 delete req.query[key]
             }

[Killed] ConditionalExpression
Sly321/express-parameter-rewriter/src/express-parameter-rewriter.ts:23:17
             if (req.url.indexOf('?' + key) >= 0 || req.url.indexOf('&' + key) >= 0) {
                 req.url = replaceUrlParameterName(req.url, key, obj[key])
                 req.originalUrl = replaceUrlParameterName(req.originalUrl, key, obj[key])
-                req.query[obj[key]] = req.query[key]
+                false
                 delete req.query[key]
             }
